# Análise Titanic - Sobreviventes

In [85]:
#Importação do Pandas
import pandas as pd

In [86]:
#Visualização da base de dados
treino = pd.read_csv('train.csv')
treino.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Para depois as 03 linhas a seguir

In [87]:
#Verificando as informações da base
treino.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [88]:
# Verificando o tipo dos dados
treino.dtypes.value_counts()

int64      5
object     5
float64    2
dtype: int64

In [89]:
#Verificando os valores nulos
treino.isnull().sum().sort_values(ascending=False).head()

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
dtype: int64

In [90]:
#Visualizando a base de TESTE
teste=pd.read_csv('test.csv')
teste.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [91]:
#Verificando as informações na base de teste
teste.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB

In [92]:
#Verificando os valores nulos
teste.isnull().sum().sort_values(ascending=False).head()

Cabin          327
Age             86
Fare             1
PassengerId      0
Pclass           0
dtype: int64

Temos colunas que possuem **valores vazios** na base de teste que não estão vazios na base de treino (nesse caso,precisamos tratar essas colunas na base de teste)

Realizando o tratamento iniciais dos dados
- Vamos começar tratando os valores vazios

In [93]:
#Verificando novamente valores vazios para a base de treino
treino.isnull().sum().sort_values(ascending=False).head()

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
dtype: int64

In [94]:
#Retornando o Shape da base
treino.shape

(891, 12)

In [95]:
# Visualizar novamente a base de dados - dados que são muito diversos em um coluna (nomes por exemplo) para essa análise 
#vão atrapalhar na criação do modelo, por este motivo essas colunas devem ser retiradas
treino.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [96]:
#Verificando a cardinalidade dos dados - valores diferente
treino.nunique().sort_values(ascending=False)

PassengerId    891
Name           891
Ticket         681
Fare           248
Cabin          147
Age             88
SibSp            7
Parch            7
Pclass           3
Embarked         3
Survived         2
Sex              2
dtype: int64

Colunas com alta cardinalidade como nome, número do ticket e até mesmo o código da cabine não vão ajudar no modelo pois podem torná-lo menos generalizável. Neste caso, vamos eliminar estas colunas.

In [97]:
#Eliminando para a base de treino
treino = treino.drop(['Name','Ticket','Cabin'],axis=1)
treino.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [98]:
#Eliminando para a base de teste
teste = teste.drop(['Name','Ticket','Cabin'],axis=1)
teste.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [99]:
#Verificando a média das idades para usa-la no preenchimento de valores vazios na coluna idade
treino.Age.mean()

29.69911764705882

In [100]:
#Vamos substituir na coluna idade
treino.loc[treino.Age.isnull(),'Age']=treino.Age.mean()

In [101]:
#Repetimos o mesmo para a base de teste
teste.loc[teste.Age.isnull(),'Age']=teste.Age.mean()

Para a base de dado treino, ainda temos 02 valores vazios na coluna Embarked
    Podemos verificar todos os valores nessa coluna e substituir os valores pela moda

In [102]:
#Verificando os valores na coluna Embarked
treino.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [103]:
#Selecionando a moda da coluna Embarked
treino.Embarked.mode()[0]

'S'

In [104]:
#Substituição dos valores vazios
treino.loc[treino.Embarked.isnull(),'Embarked'] = treino.Embarked.mode()[0]

Agora tratando o valores nulos em Fare
    Vamos fazer a substituição usando a média

In [105]:
#Fazendo a substituição do valor nulo pela média
teste.loc[teste.Fare.isnull(),'Fare'] = teste.Fare.mean()

In [106]:
#Verificando se todos os valores nulos foram tratodos na base de treino
treino.isnull().sum().sort_values(ascending=False).head()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
dtype: int64

In [107]:
#Verificando se todos os valores nulos foram tratodos na base de teste
teste.isnull().sum().sort_values(ascending=False).head()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
dtype: int64

## Separando as colunas que não são de texto

In [108]:
#Verificando as colunas de texto na base de treino
col_treino_numerico = treino.columns[treino.dtypes != 'object']
col_treino_numerico

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [109]:
#Selecionando apenas valores numéricos na base treino
treino_numerico = treino.loc[:, col_treino_numerico]
treino_numerico.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [110]:
#Verificando as colunas de texto na base de teste
col_teste_numerico = teste.columns[teste.dtypes != 'object']
col_teste_numerico

Index(['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [111]:
teste_numerico = teste.loc[:, col_teste_numerico]
teste_numerico.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0          892       3  34.5      0      0   7.8292
1          893       3  47.0      1      0   7.0000
2          894       2  62.0      0      0   9.6875
3          895       3  27.0      0      0   8.6625
4          896       3  22.0      1      1  12.2875

### Podemos agora selecionar um modelo para classificar esses dados

In [112]:
#Importando o train_test_split
from sklearn.model_selection import train_test_split

In [113]:
#Separndo a base de dados de treino em X e Y
x=treino_numerico.drop(['PassengerId','Survived'],axis=1)
y=treino.Survived

In [114]:
#Separando em treino e validação
x_train, x_val, y_train, y_val = train_test_split(x, y, test_size=0.33, random_state=42)

Para a árvore de classificação

In [115]:
from sklearn import tree

In [116]:
#crindo a classicação
clt_arvore_classificacao = tree.DecisionTreeClassifier(random_state=42)

In [117]:
#Fazendo o fit com dados
clt_arvore_classificacao = clt_arvore_classificacao.fit(x_train, y_train)

In [118]:
#Fazendo a previsão
y_pred_arvore_classificacao = clt_arvore_classificacao.predict(x_val)

Para o KNeighborsClassifier

In [119]:
from sklearn.neighbors import KNeighborsClassifier

In [120]:
#Criando o classificador
clf_knn = KNeighborsClassifier(n_neighbors=3)

In [121]:
#Fazendo o fit dos dados
clf_knn = clf_knn.fit(x_train, y_train)

In [122]:
#Fazendo a previsão
y_pred_knn = clf_knn.predict(x_val)

Regressão Logística

In [123]:
from sklearn.linear_model import LogisticRegression

In [124]:
#Criando o Classificador
clf_regressaoLinear = LogisticRegression(random_state=42)

In [125]:
#Fazendo o fit com dados
clf_regressaoLinear = clf_regressaoLinear.fit(x_train, y_train)

In [126]:
#Fazendo a previsão
y_pred_clf_regressaoLinear = clf_regressaoLinear.predict(x_val)

  Avaliação do Modelos

In [127]:
from sklearn.metrics import accuracy_score

In [128]:
#A acuracia para a Árvore - clt_arvore_classificacao
accuracy_score(y_val, y_pred_clf_regressaoLinear)

0.7254237288135593

In [129]:
#Para o KNeighborsClassifier - knn
accuracy_score(y_val, y_pred_knn)

0.6542372881355932

In [130]:
#Para a regressão logística
accuracy_score(y_val, y_pred_clf_regressaoLinear)

0.7254237288135593

### Avaliando a matriz de confusão

In [131]:
from sklearn.metrics import confusion_matrix

In [132]:
#Para a Árvore - clt_arvore_classificacao
confusion_matrix(y_val, y_pred_clf_regressaoLinear)

array([[156,  19],
       [ 62,  58]], dtype=int64)

In [133]:
#Para o KNeighborsClassifier - knn
confusion_matrix(y_val, y_pred_knn)

array([[133,  42],
       [ 60,  60]], dtype=int64)

In [134]:
#Para a regressão logística
confusion_matrix(y_val, y_pred_clf_regressaoLinear)

array([[156,  19],
       [ 62,  58]], dtype=int64)

Fazendo a previsão para os dados de teste

In [135]:
#Visualizando o X_train
x_train.head()

     Pclass        Age  SibSp  Parch     Fare
6         1  54.000000      0      0  51.8625
718       3  29.699118      0      0  15.5000
685       2  25.000000      1      2  41.5792
73        3  26.000000      1      0  14.4542
882       3  22.000000      0      0  10.5167

In [136]:
#Visualizando a base de teste (apenas com valores numéricos)
teste_numerico.head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0          892       3  34.5      0      0   7.8292
1          893       3  47.0      1      0   7.0000
2          894       2  62.0      0      0   9.6875
3          895       3  27.0      0      0   8.6625
4          896       3  22.0      1      1  12.2875

In [137]:
#Para que a base de teste seja igual a base treino, precisamos eliminar a coluna de PassengerId
x_teste = teste_numerico.drop('PassengerId', axis=1)
x_teste.head()

   Pclass   Age  SibSp  Parch     Fare
0       3  34.5      0      0   7.8292
1       3  47.0      1      0   7.0000
2       2  62.0      0      0   9.6875
3       3  27.0      0      0   8.6625
4       3  22.0      1      1  12.2875

In [138]:
#Utilizando a regressão logística na base de teste
y_pred = clf_regressaoLinear.predict(x_teste)

In [139]:
#Criando uma nova coluna com a previsão na base de teste
teste['Survived'] = y_pred

In [140]:
#Selecionando apenas a coluna de Id e Survived para fazer o envio
base_envio = teste[['PassengerId','Survived']]
base_envio

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [141]:
#Exportando para csv
base_envio.to_csv('resultado.csv',index=False)